In [12]:
import numpy as np
import pandas as pd

In [13]:
#df = pd.DataFrame([['a','b','c'], [1,2,3]])
#df = pd.DataFrame({'a':[1,2,3],'b':[5,6,7]})
#df = pd.DataFrame(np.random.randn(3,2))
df = pd.DataFrame(np.random.randint(1,10,6) .reshape (2,3), columns=['Cruzeiro', 'Atletico','America'],
                 index=['Gols','Vitorias'])
df

          Cruzeiro  Atletico  America
Gols             7         3        1
Vitorias         4         4        3

**Selecão de dados**

In [14]:
type(df['Atletico'])

pandas.core.series.Series

In [23]:
df['Cruzeiro']['Vitorias']

2

In [25]:
df.Cruzeiro

Gols        4
Vitorias    2
Name: Cruzeiro, dtype: int32

In [6]:
df

NameError: name 'df' is not defined

In [27]:
df.loc['Vitorias']

Cruzeiro    2
Atletico    5
America     6
Name: Vitorias, dtype: int32

In [28]:
df.loc[['Vitorias'],['Atletico','America']]

          Atletico  America
Vitorias         5        6

In [29]:
df.iloc[1]

Cruzeiro    2
Atletico    5
America     6
Name: Vitorias, dtype: int32

In [30]:
df.iloc[0,1:3]

Atletico    3
America     6
Name: Gols, dtype: int32

**Adição e Remoção de Linhas e Colunas no DataFrame**

In [14]:
df

          Cruzeiro  Atletico  America
Gols             7         3        1
Vitorias         4         4        3

In [15]:
df['Flamego']=[3,17]
df

          Cruzeiro  Atletico  America  Flamego
Gols             7         3        1        3
Vitorias         4         4        3       17

In [16]:
df.loc['Empates']=[0,0,0,0]

          Cruzeiro  Atletico  America  Flamego
Gols             7         3        1        3
Vitorias         4         4        3       17
Empates          0         0        0        0

In [17]:
df.drop('America', axis=1)

          Cruzeiro  Atletico  Flamego
Gols             7         3        3
Vitorias         4         4       17
Empates          0         0        0

In [18]:
df

          Cruzeiro  Atletico  America  Flamego
Gols             7         3        1        3
Vitorias         4         4        3       17
Empates          0         0        0        0

In [20]:
df.drop('America', axis=1, inplace=True)

KeyError: "['America'] not found in axis"

In [21]:
df

          Cruzeiro  Atletico  Flamego
Gols             7         3        3
Vitorias         4         4       17
Empates          0         0        0

In [22]:
del df['Cruzeiro']

In [23]:
df

          Atletico  Flamego
Gols             3        3
Vitorias         4       17
Empates          0        0

In [25]:
df.drop('Empates',axis=0)

          Atletico  Flamego
Gols             3        3
Vitorias         4       17

In [26]:
df

          Atletico  Flamego
Gols             3        3
Vitorias         4       17
Empates          0        0

In [28]:
df.drop('Empates',axis=0, inplace=True)

In [29]:
df

          Atletico  Flamego
Gols             3        3
Vitorias         4       17

In [32]:
df2 = pd.DataFrame({'a':[1,2,np.nan],'b':[5,6,7],'c':[2,4,np.nan]})
df2

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0
2  NaN  7  NaN

In [33]:
df2.dropna()

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0

In [34]:
df2.drop_duplicates(subset=['a'])

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0
2  NaN  7  NaN

In [35]:
df2.fillna('Helio')

       a  b      c
0    1.0  5    2.0
1    2.0  6    4.0
2  Helio  7  Helio

In [36]:
df2.fillna(value=df2['b'].mean())

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0
2  6.0  7  6.0

In [37]:
df = pd.DataFrame({"modelo":["Uno","Monza","Camaro","Gol","Palio"],
                  "marca":["Fiat","Chevrolet","Chevrolet","VW","Fiat"],
                  "valor":[10000,20000,20000,30000,15000],
                   "unidades":[10,30,100,25,15]})
df

   modelo      marca  valor  unidades
0     Uno       Fiat  10000        10
1   Monza  Chevrolet  20000        30
2  Camaro  Chevrolet  20000       100
3     Gol         VW  30000        25
4   Palio       Fiat  15000        15

**Métodos Descritivos**

In [38]:
df.describe()

              valor    unidades
count      5.000000    5.000000
mean   19000.000000   36.000000
std     7416.198487   36.640142
min    10000.000000   10.000000
25%    15000.000000   15.000000
50%    20000.000000   25.000000
75%    20000.000000   30.000000
max    30000.000000  100.000000

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   modelo    5 non-null      object
 1   marca     5 non-null      object
 2   valor     5 non-null      int64
 3   unidades  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [42]:
df.count()

modelo      5
marca       5
valor       5
unidades    5
dtype: int64

In [43]:
df

   modelo      marca  valor  unidades
0     Uno       Fiat  10000        10
1   Monza  Chevrolet  20000        30
2  Camaro  Chevrolet  20000       100
3     Gol         VW  30000        25
4   Palio       Fiat  15000        15

In [45]:
grupo = df.groupby("marca")
grupo['marca'].count()

marca
Chevrolet    2
Fiat         2
VW           1
Name: marca, dtype: int64

In [46]:
grupo['modelo'].value_counts()

marca      modelo
Chevrolet  Camaro    1
           Monza     1
Fiat       Palio     1
           Uno       1
VW         Gol       1
Name: modelo, dtype: int64

In [47]:
grupo['valor'].mean()

marca
Chevrolet    20000.0
Fiat         12500.0
VW           30000.0
Name: valor, dtype: float64

In [48]:
grupo['unidades'].sum()

marca
Chevrolet    130
Fiat          25
VW            25
Name: unidades, dtype: int64

In [49]:
df['marca'].unique()

array(['Fiat', 'Chevrolet', 'VW'], dtype=object)

In [50]:
df['marca'].nunique()

3

In [51]:
df['marca'].value_counts()

Fiat         2
Chevrolet    2
VW           1
Name: marca, dtype: int64

In [52]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]},index=[19,20,21])
df2 = pd.DataFrame({'C':['a','b','c'],'D':['d','e','f']},index=[20,21,22])

**União de DataFrames**

In [53]:
df1

    A  B
19  1  4
20  2  5
21  3  6

In [54]:
df2

    C  D
20  a  d
21  b  e
22  c  f

In [56]:
pd.concat([df1,df2], axis=1)

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  NaN  NaN    c    f

In [60]:
df1.join(df2,how='outer').fillna(df1['A'].mean())

      A    B    C    D
19  1.0  4.0  2.0  2.0
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  2.0  2.0    c    f

**Filtros**

In [63]:
df1['c']=[8,10,12]

In [64]:
df1

    A  B   c
19  1  4   8
20  2  5  10
21  3  6  12

In [65]:
df1.loc[22]=[13,16,19]

In [66]:
df1

     A   B   c
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [67]:
df1[df1['A']>2]

     A   B   c
21   3   6  12
22  13  16  19

In [73]:
df1[(df1['A']>2) & (df1['c']>15)]

     A   B   c
22  13  16  19

In [71]:
df1[df1['B'] == 6]

    A  B   c
21  3  6  12

**Função apply**

In [74]:
df1

     A   B   c
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [75]:
df1.apply(lambda x:x*3)

     A   B   c
19   3  12  24
20   6  15  30
21   9  18  36
22  39  48  57

In [76]:
df1

     A   B   c
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [84]:
def maioresCincoA(x):
    if x > 5:
        return True
    else:
        return False
#df1['Maiores']=df1['A'].apply(maioresCincoA)
df1['A']=df1['A'].apply(maioresCincoA)

In [85]:
df1

        A   B   c
19  False   4   8
20  False   5  10
21  False   6  12
22   True  16  19

**Importar DataFrame**

In [91]:
df = pd.read_csv("netflix_titles.csv", sep=',')
df.head()

,Unnamed: 0,title,year,kind,genre,rating,vote,country,language,runtime,cast,director,composer,writer,runtimes
0,0,Dinosaur Planet,2003.0,tv mini series,"['Documentary', 'Animation', 'Family']",7.7,474.0,['United States'],['English'],['50'],"['Christian Slater', 'Scott Sampson']",NaN,NaN,"['Mike Carrol', 'Mike Carroll', 'Georgann Kane']",NaN
1,1,Character,2021.0,movie,"['Crime', 'Horror', 'Thriller']",8.3,46.0,['Japan'],['Japanese'],['125'],"['Masaki Suda', 'Fukase', 'Mitsuki Takahata', ...",['Akira Nagai'],['Youki Kojima'],"['Takashi Nagasaki', 'Takashi Nagasaki', 'Anna...",NaN
2,2,Get Up and Dance!,1994.0,video movie,['Family'],8.1,18.0,['United States'],['English'],['54'],"['Paula Abdul', 'Aurorah Allain', 'Bill Bohl',...",['Steve Purcell'],NaN,NaN,NaN
3,3,The Rise and Fall of El Chapo,2016.0,tv movie,['Documentary'],6.9,42.0,['United States'],NaN,['85'],NaN,NaN,NaN,NaN,NaN
4,4,Sick - IMDb,NaN,NaN,['Thriller'],NaN,NaN,['United States'],NaN,NaN,"['Marc Menchaca', 'Gideon Adlon', 'Dylan Spray...",['John Hyams'],NaN,"['Katelyn Crabb', 'Kevin Williamson']",NaN

In [92]:
del df['Unnamed: 0']

In [93]:
df.head()

,title,year,kind,genre,rating,vote,country,language,runtime,cast,director,composer,writer,runtimes
0,Dinosaur Planet,2003.0,tv mini series,"['Documentary', 'Animation', 'Family']",7.7,474.0,['United States'],['English'],['50'],"['Christian Slater', 'Scott Sampson']",NaN,NaN,"['Mike Carrol', 'Mike Carroll', 'Georgann Kane']",NaN
1,Character,2021.0,movie,"['Crime', 'Horror', 'Thriller']",8.3,46.0,['Japan'],['Japanese'],['125'],"['Masaki Suda', 'Fukase', 'Mitsuki Takahata', ...",['Akira Nagai'],['Youki Kojima'],"['Takashi Nagasaki', 'Takashi Nagasaki', 'Anna...",NaN
2,Get Up and Dance!,1994.0,video movie,['Family'],8.1,18.0,['United States'],['English'],['54'],"['Paula Abdul', 'Aurorah Allain', 'Bill Bohl',...",['Steve Purcell'],NaN,NaN,NaN
3,The Rise and Fall of El Chapo,2016.0,tv movie,['Documentary'],6.9,42.0,['United States'],NaN,['85'],NaN,NaN,NaN,NaN,NaN
4,Sick - IMDb,NaN,NaN,['Thriller'],NaN,NaN,['United States'],NaN,NaN,"['Marc Menchaca', 'Gideon Adlon', 'Dylan Spray...",['John Hyams'],NaN,"['Katelyn Crabb', 'Kevin Williamson']",NaN

In [94]:
df.describe()

              year       rating          vote
count  9756.000000  8949.000000  8.949000e+03
mean   1994.739750     6.680635  2.121821e+04
std      16.245087     1.285113  9.804873e+04
min    1905.000000     1.000000  5.000000e+00
25%    1989.750000     6.000000  2.830000e+02
50%    1999.000000     6.900000  1.535000e+03
75%    2003.000000     7.600000  7.570000e+03
max    2023.000000     9.600000  2.462087e+06

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9826 entries, 0 to 9825
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     9825 non-null   object
 1   year      9756 non-null   float64
 2   kind      9788 non-null   object
 3   genre     9733 non-null   object
 4   rating    8949 non-null   float64
 5   vote      8949 non-null   float64
 6   country   9161 non-null   object
 7   language  9033 non-null   object
 8   runtime   5916 non-null   object
 9   cast      9482 non-null   object
 10  director  7966 non-null   object
 11  composer  6204 non-null   object
 12  writer    8170 non-null   object
 13  runtimes  2854 non-null   object
dtypes: float64(3), object(11)
memory usage: 1.0+ MB

In [100]:
print (df.head(20).to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>title</th>
      <th>year</th>
      <th>kind</th>
      <th>genre</th>
      <th>rating</th>
      <th>vote</th>
      <th>country</th>
      <th>language</th>
      <th>runtime</th>
      <th>cast</th>
      <th>director</th>
      <th>composer</th>
      <th>writer</th>
      <th>runtimes</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Dinosaur Planet</td>
      <td>2003.0</td>
      <td>tv mini series</td>
      <td>['Documentary', 'Animation', 'Family']</td>
      <td>7.7</td>
      <td>474.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['50']</td>
      <td>['Christian Slater', 'Scott Sampson']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['Mike Carrol', 'Mike Carroll', 'Georgann Kane']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Character</td>
      <td>2021.0</td>
      <td>movie</td>
      <td>['Crime', 'Horror', 'Thriller']</td>
      <td>8.3</td>
      <td>46.0</td>
      <td>['Japan']</td>
      <td>['Japanese']</td>
      <td>['125']</td>
      <td>['Masaki Suda', 'Fukase', 'Mitsuki Takahata', 'Shidô Nakamura', 'Shun Oguri', 'Jun Hashizume', 'Hijiri Kojima', 'Yôji Matsuda', 'Ai Mikami', 'Tomu Miyazaki', 'Akiyoshi Nakao', 'Shigemitsu Ogi', 'Takashi Okabe', 'Ryushin Tei']</td>
      <td>['Akira Nagai']</td>
      <td>['Youki Kojima']</td>
      <td>['Takashi Nagasaki', 'Takashi Nagasaki', 'Anna Kawahara']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Get Up and Dance!</td>
      <td>1994.0</td>
      <td>video movie</td>
      <td>['Family']</td>
      <td>8.1</td>
      <td>18.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['54']</td>
      <td>['Paula Abdul', 'Aurorah Allain', 'Bill Bohl', 'Bob Gaynor', "Nancy O'Meara"]</td>
      <td>['Steve Purcell']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>The Rise and Fall of El Chapo</td>
      <td>2016.0</td>
      <td>tv movie</td>
      <td>['Documentary']</td>
      <td>6.9</td>
      <td>42.0</td>
      <td>['United States']</td>
      <td>NaN</td>
      <td>['85']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Sick - IMDb</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['Thriller']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['United States']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['Marc Menchaca', 'Gideon Adlon', 'Dylan Sprayberry', 'Bethlehem Million', 'Aarman Touré']</td>
      <td>['John Hyams']</td>
      <td>NaN</td>
      <td>['Katelyn Crabb', 'Kevin Williamson']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>5</th>
      <td>8 Man</td>
      <td>1992.0</td>
      <td>movie</td>
      <td>['Action', 'Sci-Fi']</td>
      <td>5.5</td>
      <td>93.0</td>
      <td>['Japan']</td>
      <td>['Japanese']</td>
      <td>['83']</td>
      <td>['Kai Shishido', 'Etsushi Takahashi', 'Sachiko Ayase', 'Osamu Ohtomo', 'Jô Shishido', 'Tadao Nakamaru', 'Daisuke Shima', 'Toshihide Wakamatsu', 'Mickey Curtis', 'Robert Axelrod', 'Steve Bulen', 'Richard Cansino', 'Lara Cody', 'Juliana Donald', 'Kerrigan Mahan', 'Edie Mirman', 'Mike Reynolds', 'Michael Sorich', 'Barry Stigler', 'Kirk Thornton', 'Dan Woren']</td>
      <td>['Yasuhiro Horiuchi']</td>
      <td>['Carole King']</td>
      <td>['Kazumasa Hirai', 'Jirô Kuwata', 'Junko Suzuki']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>6</th>
      <td>What the #$*! Do We (K)now!?</td>
      <td>2004.0</td>
      <td>movie</td>
      <td>['Documentary', 'Comedy', 'Drama', 'Fantasy', 'Mystery', 'Sci-Fi']</td>
      <td>5.3</td>
      <td>13432.0</td>
      <td>['United States']</td>
      <td>['English', 'German', 'Spanish']</td>
      <td>['109']</td>
      <td>['Marlee Matlin', 'Elaine Hendrix', 'John Ross Bowie', 'Robert Bailey Jr.', 'Barry Newman', 'Larry Brandenburg', 'Daniela Serra', 'James Langston Drake', 'Michele Mariana', 'Armin Shimerman', 'Robert Blanche', 'Pavel Mikoloski', 'Alex Rogers', 'Tin Tran', 'Leslie Taylor', 'Sherilyn Lawson', 'Mercedes Rose', 'Joelle Anthony', 'Dawnn Pavlonnis', 'Danny Bruno', 'Josh Santos', 'Kerensa Gimre', 'Heather Robertson', 'Patti Collins', 'Tammy Mischke', 'Justin Canfield', 'Gordon Grobelny', 'Brent Pendleton', 'Jonathan Cammon', 'Val Landrum', 'Kyle Lunde', 'Gloria Manon', 'Robert McKeehen', 'Eric Newsome', 'Kirk Thornton', 'Michelle Ruff', 'Lia Sargent', 'Michael Sorich', 'Steve Blum', 'Tom Fahn', 'Allison Gottfried', 'David Albert', 'Joseph Dispenza', 'Amit Goswami', 'John Hagelin', 'Stuart Hameroff', 'J.Z. Knight', 'Miceal Ledwith', 'Daniel Monti', 'Andrew Newberg', 'Candace Pert', 'Jeffrey Satinover', 'William Tiller', 'Fred Alan Wolf', 'Marsha Clark', 'William Joseph Elk III', 'Evan Jacobs', 'Jeff S. Dodge', 'Carol Stanzione', 'Casper Van Dien', 'Tara Walker']</td>
      <td>['William Arntz', 'Betsy Chasse', 'Mark Vicente']</td>
      <td>['Christopher Franke']</td>
      <td>['William Arntz', 'Betsy Chasse', 'Matthew Hoffman']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>7</th>
      <td>Class of Nuke 'Em High Part II: Subhumanoid Meltdown</td>
      <td>1991.0</td>
      <td>movie</td>
      <td>['Comedy', 'Horror', 'Sci-Fi']</td>
      <td>4.5</td>
      <td>2177.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['96']</td>
      <td>['Brick Bronsky', 'Lisa Gaye', 'Leesa Rowland', 'Michael Kurtz', 'Scott Resnick', 'Jacki Moen', 'Robert Dawson', 'Phil Rivo', 'Erica Frank', 'Sharon E. Gardner', 'Bea Lindgren', 'Lorraine Parchment', 'Troy Fromin', 'Tyler Bowe', 'Paul Borghese', 'Amy Hilbrich', 'Brad Roth', 'Nello Scadato', 'Jean Stewart', 'Gerrard Course', 'Lindsey Dawkins', 'Darla Haun', 'Lily Hayes Kaufman', 'Jason Vance Taylor', 'Alex Pirnie', 'William J. Kulzer', 'Kaptain', 'Madison Monk', 'Greta Rubens', 'Jon Albert', 'Patricia Kaufman', 'Jerri Greene', 'Patti Williford', 'Thomas Perry', 'Wendy Burnell', 'Shane Christopher', 'Ana Debasa', 'Jesse Cole Johnson', 'Andre Lambert', 'Jeanne LeGrand', 'Julie Nine', 'Louis Ortiz', 'Glorivic Parong', 'Suzanne Solari', 'Lisa Star', 'Saint Teresa Stone', 'Billie Taylor', 'Veronica Stork', 'Elizabeth Young', 'Kristina Krofft', 'Maraya Chase', 'Sophia Orkulas', 'Traci Mann', 'Walt Kubiak', 'Martin Sokol', 'Mark Richardson', 'Diana C. Skinner', 'Sheri Belfert', 'Bonnie Clarke', 'Heather Forsyth', 'Susan Jones', 'Trinity Loren', 'Sharon Mitchell', 'Phoebe Phaigh', 'Sandy Ruthowski', 'Nicole Vasilopoulos', 'Ryan Jones', 'Andy Jones', 'John Bausch', 'Gilbran Chong', 'Charlotte Kaufman', 'Lisbeth Kaufman', 'Shanah Richardson', 'Sherie Richardson', 'Cosimo Sherman', 'Josh Greenie', 'Brent Lichman', 'Wes Lichtman', 'Rocky Sherman', 'Jessi Woodhull', 'Shelby Shepard', 'Bullet Valmont', 'Liz Ard', 'Michael Cadava', 'Corey Hawk', 'Michael Herz', 'Lloyd Kaufman', 'Cynthia Windham']</td>
      <td>['Eric Louzil']</td>
      <td>['Bob Mithoff']</td>
      <td>['Lloyd Kaufman', 'Carl Morano', 'Matt Unger']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>8</th>
      <td>The Fighter</td>
      <td>2010.0</td>
      <td>movie</td>
      <td>['Biography', 'Drama', 'Sport']</td>
      <td>7.8</td>
      <td>351199.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['116']</td>
      <td>['Mark Wahlberg', 'Christian Bale', 'Amy Adams', 'Melissa Leo', "Mickey O'Keefe", 'Jack McGee', 'Melissa McMeekin', 'Bianca Hunter', 'Erica McDermott', 'Jill Quigg', 'Dendrie Taylor', "Kate B. O'Brien", 'Jenna Lamia', 'Frank Renzulli', 'Paul Campbell', 'Caitlin Dwyer', 'Chanty Sok', 'Ted Arcidi', 'Ross Bickell', 'Sean Malone', 'José Antonio Rivera', 'Richard Farrell', 'Matthew Muzio', 'Steven Barkhimer', 'Art Ramalho', 'Sugar Ray Leonard', 'Jackson Nicoll', 'Alison Folland', 'Sean Patrick Doherty', 'Sue Costello', 'Thomas Benton', 'Ray Greenhalge', 'Tino Kimly', 'Epifanio Melendez', 'Jeremiah Kissel', 'Sean Eklund', 'Roeun Chea', 'Brian Nguyen', 'Rikki Kleiman', "Michael Dell'Orto", 'Paul Locke', 'Kim Carrell', 'Colin Hamell', 'Dale Place', 'Eddie Lee Anderson', 'Joe Lupino', 'Bonnie Aarons', 'Walter Driscoll', 'Matt Russell', 'A. Joseph Denucci', 'Dicky Eklund', 'George Michael Ward', 'Dicky Eklund Jr.', 'Jack Greenhalge', 'Kevin Paige', 'David A. Ramalho Sr.', 'Ziad Akl', 'Simon Hamlin', 'Gerald Greenhalge', 'Matthew Russell', 'Tommy Eklund', 'Rita Mercier', 'Deborah Bolanger', 'Kerry Moore', 'Philip Dorn Hebert', 'Raul Vera', 'Jack Lally', 'Carlos L. Smith', 'Lee Wesley', 'Hugh Long', 'Catherine Lynn Stone', 'Eric Weinstein', 'Bo Cleary', 'Anthony Molinari', 'Peter Cunningham', 'Miguel Espino', "Anthony 'Ace' Thomas", 'Brian Christensen', 'Jen Weissenberg', 'Michael Buffer', 'Larry Merchant', 'Jim Lampley', 'Emanuel Steward', 'Roy Jones Jr.', 'George Foreman', 'Don Dunphy', 'Barry Ace', 'Diana Afonso', 'Charlie Alejandro', 'Mel Alejandro', 'Cindi Alex', 'Christian Alvarado', 'Clyde Anthony', 'Kt Baldassaro', 'Joseph Basile', 'Irene Doukas Behrman', 'Joseph Bianchi-Coppola', 'Brina', 'Jodie Brunelle', 'Tommy Burke', 'Ryan Burton', 'Alex Bussell', 'Todd Byron', 'Gino Cafarelli', 'Katelyn Cahill', 'Al Conti', 'Jeffrey Corazzini', 'D.W. Cormier', 'Max Cross', 'Ryan Cultrera', 'Shawn Patrick Curley', 'Tommy Dallace', 'Christopher J. Davis', 'Nicholas Davis', 'Richard DeAgazio', 'Kevin DeCoste', 'Luisa Diaz', 'Ronald Diberto', 'Shawn Doherty', 'Uke Doiron', 'James Donnelly', 'Parvinder Dosanjh', 'Dani Druz', 'Ger Duany', 'Susan Farese', 'Mugisha Feruzi', 'Shawn Fogarty', 'Evan Fonseca', 'Rich Foster', 'John Franchi', 'Dennis Jay Funny', 'Ryan Gleason', 'Albert Gornie', 'Josh Gunderson', 'London Hall', 'Lindsay Hanzl', 'Becky Burne Harvey', 'Louis Holmes', 'Frankie Imbergamo', 'Anthony Jon', 'Ken Kansky', 'Mikey Kelley', 'Bobby Kenney', 'Kimko', 'Jeffery Kincannon', 'David A. Kirsch', 'Ren Knopf', 'Ryan LaMarca', 'Pat Lambert', 'Deme Lane', 'Justin James Lang', 'Henry Laun', 'Dennis Lauricella', 'Jordan Lazieh', 'Jacqueline Levasseur', 'Sal Lizard', 'Alicia Love', 'Tim MacLean', 'Jeffrey Malick', 'Michael Marchand', 'Conan Marchi', 'Rob Marin', 'Dan Marshall', 'Brett McCabe', 'Vanessa McCaffrey', 'Tricia Clift McCrone', 'Kenn Medeiros', 'Wayne R. Miller', 'Leigh Nicole', 'Joseph Oliveira', 'Thomas Olson', 'Bernie Ongewe', 'Richard Pacheco', 'Jim Patton', 'Henry Penzi', 'Americo Presciutti', 'David Pulson', 'Dannielle Rose', 'Eric Ryan', 'Robert Sabino', 'Megan Sacco', 'Salvatore Santone', 'Victoria Saunders', 'Hester Schell', 'James Shalkoski Jr.', 'Ron Shimshilashvili', 'Joe Siriani', 'Briggon Snow', 'David Arthur Sousa', 'Kevin Stanton', 'David Struffolino', 'Ben Tanguay', 'Seamus Towle', 'Beau Turgeon', 'J.T. Turner', 'Vinnie Varone', 'Kayla Rae Vesce', "Billy 'V' Vigeant", 'Micky Ward', 'Lindsey Warm', 'Hunter Wilichoski', 'Josh Woolstenhulme', 'Darryl Wooten']</td>
      <td>['David O. Russell']</td>
      <td>['Michael Brook']</td>
      <td>['Scott Silver', 'Paul Tamasy', 'Eric Johnson']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>9</th>
      <td>The Lord of the Rings: The Return of the King - Extended Edition</td>
      <td>2019.0</td>
      <td>episode</td>
      <td>['Talk-Show']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['250']</td>
      <td>['Aaron Elliott', 'Shane Farley', 'Calvin Grubb', 'Richard Martin', 'Eric Whiteley']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>10</th>
      <td>Antarctica: The End of Earth - Iceberg</td>
      <td>1999.0</td>
      <td>episode</td>
      <td>['Documentary', 'Family']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['George Page']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>11</th>
      <td>Neil Diamond: Greatest Hits Live</td>
      <td>1988.0</td>
      <td>video movie</td>
      <td>['Documentary', 'Music']</td>
      <td>8.0</td>
      <td>81.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['60']</td>
      <td>['Neil Diamond', 'Richard Bennett', 'Vince Charles', 'King Errisson', 'Tom Hensley', 'Alan E. Lindgren', 'Linda Press', 'Reinie Press', 'Doug Rhone', 'Ronnie Tutt']</td>
      <td>['Dwight Hemion', 'Peter Israelson']</td>
      <td>NaN</td>
      <td>['Kenny Solms', 'Ann Elder', 'Toem Perew']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>12</th>
      <td>7 Seconds</td>
      <td>2005.0</td>
      <td>video movie</td>
      <td>['Action', 'Comedy', 'Crime', 'Thriller']</td>
      <td>4.8</td>
      <td>7153.0</td>
      <td>['United Kingdom', 'Romania', 'Switzerland', 'United States']</td>
      <td>['English']</td>
      <td>['96']</td>
      <td>['Wesley Snipes', 'Tamzin Outhwaite', 'Deobia Oparei', 'Georgina Rylance', 'Pete Lee-Wilson', 'Serge Soric', 'Andrei Ionescu', 'Elias Ferkin', 'Bogdan Farkas', 'Tomi Cristin', 'Adrian Lukis', 'Stephen Boxer', 'Adrian Pintea', 'Corey Johnson', 'George Anton', 'Tamer Hassan', 'Lisa Lovbrand', 'Dan Badarau', 'William Armstrong', 'Martin Wheeler', 'Warren Derosa', 'Vasile Albinet', 'Zoltan Butuc', 'Radu Bânzaru', 'Florian Ghimpu', 'Hawk Younkins']</td>
      <td>['Simon Fellows']</td>
      <td>['Barry Taylor', 'Neal Acree']</td>
      <td>['Martin Wheeler']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>13</th>
      <td>By Dawn's Early Light</td>
      <td>1990.0</td>
      <td>tv movie</td>
      <td>['Action', 'Drama', 'Thriller']</td>
      <td>7.1</td>
      <td>2898.0</td>
      <td>['United States']</td>
      <td>['English', 'Russian']</td>
      <td>['100']</td>
      <td>['Powers Boothe', 'Rebecca De Mornay', 'James Earl Jones', 'Martin Landau', 'Darren McGavin', 'Rip Torn', 'Jeffrey DeMunn', 'Peter MacNicol', 'Glenn Withrow', 'Ronald William Lawrence', 'Kieran Mulroney', 'Nicolas Coster', 'Ken Jenkins', 'Randal Patrick', 'Daniel Benzali', "Robert O'Reilly", 'Annabella Price', 'Ann Gillespie', 'Glenn Morshower', 'Dana Kimmell', 'Jon Paul Steuer', 'Danielle von Zerneck', 'Katherine Cortez', 'Jon Cedar', 'Paul Tompkins', 'Tony Rayner', 'Richard Speight Jr.', 'T.R. Marino', 'Steve Eastin', 'Steve Rankin', 'Mike Gomez', 'Scott Trost', 'Pat Skipper', 'Adrian Ricard', 'Douglas Tolbert', 'Bill Moynihan', 'Dagmar Stansova', 'Ray Nazzari', 'Richard Assad', 'Andrew Divoff']</td>
      <td>['Jack Sholder']</td>
      <td>['Trevor Jones']</td>
      <td>['William Prochnau', 'Bruce Gilbert']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>14</th>
      <td>Seeta Aur Geeta</td>
      <td>1972.0</td>
      <td>movie</td>
      <td>['Adventure', 'Comedy', 'Drama', 'Family', 'Musical', 'Romance']</td>
      <td>6.8</td>
      <td>1818.0</td>
      <td>['India']</td>
      <td>['Hindi']</td>
      <td>['162']</td>
      <td>['Dharmendra', 'Sanjeev Kumar', 'Hema Malini', 'Manorama', 'Pratima Devi', 'Satyendra Kapoor', 'Kamal Kapoor', 'Ratnamala', 'Radhika Rani', 'Honey Irani', 'Dev Kishan', 'Alankar Joshi', 'Roopesh Kumar', 'Keshav Rana', 'Mushtaq Merchant', 'Deepak', 'M.B. Shetty', 'Suresh', 'Master Ravi', 'Abhi Bhattacharya', 'Asit Kumar Sen', 'Dulari', 'Asrani', 'Ashoo', 'Harbans Darshan M. Arora', 'Ravi Kumar', 'Mamaji', 'Surendra Rahi', 'Yasmin']</td>
      <td>['Ramesh Sippy']</td>
      <td>['Rahul Dev Burman']</td>
      <td>['Javed Akhtar', 'Javed Akhtar', 'Satish Bhatnagar']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>15</th>
      <td>Strange Relations</td>
      <td>2001.0</td>
      <td>tv movie</td>
      <td>['Drama', 'Comedy']</td>
      <td>7.6</td>
      <td>768.0</td>
      <td>['United Kingdom', 'United States']</td>
      <td>['English']</td>
      <td>['120']</td>
      <td>['Paul Reiser', 'Amber Sealey', 'Lachele Carl', 'George Wendt', 'Catherine Porter', 'Todd Boyce', 'Olympia Dukakis', 'Nicola Barnfield', 'Mary Cunningham', 'Julie Walters', 'Amy Robbins', 'Gregory Fossard', 'Rowan Humphries', 'Tony Maudsley', 'Suzanne Hitchmough', 'Georgina Smith', 'Ricky Tomlinson', 'Ian Puleston-Davies', 'Christopher Wright', 'Marcel Vormawah-Jones', 'Lee Gilbert', 'Kenny Thompson', 'Terry Gilbert', 'David Heath', 'Stephanie Roscoe', 'Marie Higham', 'Gareth Turtle', 'Sarah Baxendale', 'Tim Kazurinsky', 'Mark Lawrence']</td>
      <td>['Paul Seed']</td>
      <td>['Rupert Gregson-Williams']</td>
      <td>['Tim Kazurinsky']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>16</th>
      <td>Sesame Street Presents: The Street We Live On</td>
      <td>2004.0</td>
      <td>episode</td>
      <td>['Animation', 'Adventure', 'Comedy', 'Family', 'Fantasy', 'Music']</td>
      <td>7.2</td>
      <td>67.0</td>
      <td>['United States']</td>
      <td>['English', 'Spanish']</td>
      <td>['55']</td>
      <td>['Sonia Manzano', 'Alan Muraoka', 'Roscoe Orman', 'Alison Bartlett', 'Emilio Delgado', 'Bob McGrath', 'Loretta Long', 'Desiree Casado', 'Olamide Faison', 'Caroll Spinney', 'Fran Brill', 'Kevin Clash', 'Jerry Nelson', 'Carmen Osbahr', 'Martin P. Robinson', 'David Rudman', 'Pam Arciero', 'Lisa Buckley', 'Bruce Connelly', "Stephanie D'Abruzzo", 'Eric Jacobson', 'Jennifer Barnhart', 'Jim Martin', 'Joey Mazzarino', 'John Tartaglia', 'Matt Vogel', 'Bryant Young', 'Steve Whitmire', 'Frank Oz', 'Christopher Cerf', 'Jim Thurman', 'Chris Becker', 'Harry Belafonte', 'Tony Bennett', 'Peter Buck', 'Northern Calloway', 'Anthony Daniels', 'Savion Glover', 'Whoopi Goldberg', 'Craig Good', 'Brian Gore', 'Seth Green', 'Jim Henson', 'Richard Hunt', 'Bill Irwin', 'Norah Jones', 'Madeline Kahn', 'Larry King', 'Will Lee', 'Bud Luckey', 'Paul McGinnis', 'Phil McGraw', 'Mike Mills', 'Mackenzie Milone', 'Miles Orman', 'Queen Latifah', 'Alaina Reed-Hall', 'Doris Roberts', 'Matt Robinson', 'Michael Stipe', 'Ruben Studdard', 'Lily Tomlin', 'William Wegman', 'John Williams III']</td>
      <td>['Kevin Clash', 'Ken Diego', 'Victor DiNapoli']</td>
      <td>NaN</td>
      <td>['Molly Boylan', 'Annie Evans', 'Christine Ferraro']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>17</th>
      <td>Lilo and Stitch</td>
      <td>2012.0</td>
      <td>episode</td>
      <td>['Documentary', 'Short']</td>
      <td>7.2</td>
      <td>22.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['4']</td>
      <td>['Doug Walker']</td>
      <td>['Doug Walker']</td>
      <td>NaN</td>
      <td>['Doug Walker', 'Doug Walker']</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>18</th>
      <td>Boycott</td>
      <td>2001.0</td>
      <td>tv movie</td>
      <td>['Drama', 'History']</td>
      <td>7.2</td>
      <td>901.0</td>
      <td>['United States']</td>
      <td>['English']</td>
      <td>['118']</td>

In [1]:
df[df['country']=='Brazil'].head(20) .to_html('netflix.html')

NameError: name 'df' is not defined

In [8]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\helio\appdata\local\programs\python\python39\lib\site-packages (1.4.26)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\helio\appdata\local\programs\python\python39\lib\site-packages (from sqlalchemy) (1.1.2)

In [9]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\helio\appdata\local\programs\python\python39\lib\site-packages (1.0.2)

In [10]:
!pip install lxml

Collecting lxml
  Using cached lxml-4.6.3-cp39-cp39-win_amd64.whl (3.5 MB)
Installing collected packages: lxml
Successfully installed lxml-4.6.3

In [11]:
from sqlalchemy import create_engine
import pymysql

In [ ]:
db_connection = create_engine("mysql+pymysql://root:@localhost:3306/wef")
df = pd.read_sql('select * from posts',con=db_connection)
df[df['Id']==42].head()

In [12]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.9-py2.py3-none-any.whl (242 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.9

In [13]:
df.to_excel('db.xlsx')

NameError: name 'df' is not defined

**Plotagem de dados**